#+TITLE: Filecoin Parameters
#+DRAFT: true
#+HUGO_SECTION: appendix
#+HUGO_BASE_DIR: ../../src

#+begin_src lisp :package orient.lang :exports none
(asdf:load-system :orient)
(in-package orient.lang)
#+end_src

#+RESULTS:
: #<PACKAGE "ORIENT.LANG">

#+begin_src lisp :package orient.lang :exports none
(defparameter *filecoin* (get-system "../orient/filecoin.orient"))
(defparameter *input* (interface:get-json-relation-list "../orient/params.json"))
(defparameter *multi-input* (interface:get-json-relation-list "../orient/multi-params.json"))
#+end_src

#+RESULTS:
: *MULTI-INPUT*

* All Parameters
#+begin_src lisp :package lang :exports results
  (let ((result-tuple (extract (solve-for *filecoin* '() *input*))))
    (org-present-tuple result-tuple *filecoin*))
#+end_src

#+RESULTS:
| Parameter                     | Type    |                 Value | Description                                                                                                                                                                                    |
| ACTOR-METHOD                  | BYTES   |                     8 | The size required to represent an actor method.                                                                                                                                                |
| ACTORS-MESSAGES-FRACTION      |         |            0.30000004 |                                                                                                                                                                                                |
| ACTORS-MESSAGES-PER-BLOCK     |         |             32.661842 |                                                                                                                                                                                                |
| ADDRESS-SIZE                  | BYTES   |                    35 | The size of an address.                                                                                                                                                                        |
| ALL-POST-MESSAGES-PER-YEAR    |         |           122557560.0 |                                                                                                                                                                                                |
| ALL-SEAL-MESSAGES-PER-YEAR    |         |             335544320 |                                                                                                                                                                                                |
| ALL-SEAL-SIZE-PER-YEAR        |         |             335544320 |                                                                                                                                                                                                |
| AVG-POSTS-MESSAGES-PER-BLOCK  |         |             11.650845 |                                                                                                                                                                                                |
| AVG-PROOFS-MESSAGES-PER-BLOCK |         |             43.549118 |                                                                                                                                                                                                |
| AVG-SEALS-MESSAGES-PER-BLOCK  |         |             31.898273 |                                                                                                                                                                                                |
| AVG-TICKETS                   |         |                     1 |                                                                                                                                                                                                |
| BLOCK-FRAMING-SIZE            | BYTES   |             14709.481 | The total amount of block framing.                                                                                                                                                             |
| BLOCK-HEADER-FIXED-SIZE       |         |                   420 |                                                                                                                                                                                                |
| BLOCK-HEADER-SIZE             |         |                  1427 |                                                                                                                                                                                                |
| BLOCK-HEADER-VARIABLE-SIZE    |         |                  1007 |                                                                                                                                                                                                |
| BLOCK-HEIGHT-SIZE             |         |                     8 |                                                                                                                                                                                                |
| BLOCK-SIG-SIZE                |         |                    96 |                                                                                                                                                                                                |
| BLOCK-SIZE                    |         |               37265.1 |                                                                                                                                                                                                |
| BLOCK-SIZE-KIB                |         |               36.3917 |                                                                                                                                                                                                |
| BLOCK-TIME                    |         |                    15 |                                                                                                                                                                                                |
| BLOCKS-IN-A-YEAR              |         |            10519200.0 |                                                                                                                                                                                                |
| BLOCKS-IN-TEN-YEARS           |         |           105192000.0 |                                                                                                                                                                                                |
| BLS-AGG-SIZE                  |         |                    96 |                                                                                                                                                                                                |
| CHAIN-SIZE-YEAR               |         |        391999060000.0 |                                                                                                                                                                                                |
| CHAIN-SIZE-YEAR-GIB           |         |             365.07758 |                                                                                                                                                                                                |
| CID-SIZE                      | BYTES   |                    35 | The size of a CID.                                                                                                                                                                             |
| COMM-C-CONSTRAINTS            |         |           218221140.0 |                                                                                                                                                                                                |
| COMM-C-OPENINGS               |         |                    15 |                                                                                                                                                                                                |
| COMM-C-TIME                   |         |             12924.399 |                                                                                                                                                                                                |
| COMM-D-CONSTRAINTS            |         |            11011791.0 |                                                                                                                                                                                                |
| COMM-D-OPENINGS               |         |                     1 |                                                                                                                                                                                                |
| COMM-D-TIME                   |         |             652.18604 |                                                                                                                                                                                                |
| COMM-P-SIZE                   |         |                    35 |                                                                                                                                                                                                |
| COMM-R-CONSTRAINTS            |         |            66070744.0 |                                                                                                                                                                                                |
| COMM-R-OPENINGS               |         |                     6 |                                                                                                                                                                                                |
| COMM-R-TIME                   |         |             3913.1165 |                                                                                                                                                                                                |
| COMMIT-SIZE                   |         |                    35 |                                                                                                                                                                                                |
| COMMIT-TIME                   |         |            14042.3955 |                                                                                                                                                                                                |
| CORES                         |         |                    16 |                                                                                                                                                                                                |
| DEGREE                        |         |                    14 |                                                                                                                                                                                                |
| DEGREE-BASE                   |         |                     6 |                                                                                                                                                                                                |
| DEGREE-EXPANDER               |         |                     8 |                                                                                                                                                                                                |
| DELTA                         |         |               0.02425 |                                                                                                                                                                                                |
| DRG-D                         |         |                   1/4 |                                                                                                                                                                                                |
| DRG-E                         |         |                   0.8 |                                                                                                                                                                                                |
| EIX                           |         |   1152921504606846976 |                                                                                                                                                                                                |
| ELECTION-PROOF-SIZE           |         |                    64 |                                                                                                                                                                                                |
| ENCODING-AMAX                 |         |                     2 |                                                                                                                                                                                                |
| ENCODING-TIME                 |         |             6605.1006 |                                                                                                                                                                                                |
| ENCODING-TIME-MINS            |         |             110.08501 |                                                                                                                                                                                                |
| EPSILON                       |         |                0.0505 |                                                                                                                                                                                                |
| EXIT-CODE                     | BYTES   |                     4 | The size of an exit code.                                                                                                                                                                      |
| EXPECTED-WINNING-MINERS       |         |                     5 |                                                                                                                                                                                                |
| FROM-ADDRESS                  |         |                    35 |                                                                                                                                                                                                |
| GAS-LIMIT                     |         |                     8 |                                                                                                                                                                                                |
| GAS-PRICE                     | BYTES   |                     8 | The size required to represent the gas limit.                                                                                                                                                  |
| GAS-USED                      | BYTES   |                     8 | The size required to represent the amount of gas used by a message.                                                                                                                            |
| GIB                           |         |            1073741824 |                                                                                                                                                                                                |
| INCLUSION-CIRCUIT-TIME        |         |             2.3098202 |                                                                                                                                                                                                |
| INCLUSION-CONSTRAINTS         |         |               39000.0 |                                                                                                                                                                                                |
| KDF-CONTENT                   |         |                    15 |                                                                                                                                                                                                |
| KDF-HASH-SIZE                 |         |                    32 |                                                                                                                                                                                                |
| KDF-HASH-TIME                 |         |            4.5608e-08 |                                                                                                                                                                                                |
| KIB                           | BYTES   |                  1024 | The number of bytes in one KiB.                                                                                                                                                                |
| LAMBDA                        |         |                    10 |                                                                                                                                                                                                |
| LAYERS                        |         |              9.634086 |                                                                                                                                                                                                |
| LAYERS-A                      |         |             6.8276772 |                                                                                                                                                                                                |
| LAYERS-B                      |         |              9.634086 |                                                                                                                                                                                                |
| LEAF-CIRCUIT-TIME             |         |             0.7417668 |                                                                                                                                                                                                |
| LEAF-CONSTRAINTS              |         |             12524.312 |                                                                                                                                                                                                |
| LEAF-HASH-CIRCUIT-TIME        |         |              0.076994 |                                                                                                                                                                                                |
| LEAF-HASH-CONSTRAINTS         |         |                  1300 |                                                                                                                                                                                                |
| LEAF-HASH-TIME                |         |            4.5608e-08 |                                                                                                                                                                                                |
| LEAF-TIME                     |         |         4.3939139e-07 |                                                                                                                                                                                                |
| MALICIOUS-ENCODING            |         |             3302.5503 |                                                                                                                                                                                                |
| MAX-TICKETS                   |         |              19.07985 |                                                                                                                                                                                                |
| MERKLE-HASH-CONSTRAINTS       |         |                  1300 |                                                                                                                                                                                                |
| MERKLE-HASH-TIME              |         |            1.3078e-05 |                                                                                                                                                                                                |
| MERKLE-HASH-TIME-CIRCUIT      |         |              0.076994 |                                                                                                                                                                                                |
| MESSAGE-NONCE                 | BYTES   |                     4 | The size of a message's nonce.                                                                                                                                                                 |
| MESSAGE-RECEIPT               | BYTES   |                    16 | The size of one message receipt.                                                                                                                                                               |
| MESSAGE-RECEIPTS-CID          | BYTES   |                    35 | The size of one message receipt's CID.                                                                                                                                                         |
| MESSAGE-SIZE                  | BYTES   |                   106 | The size of a single message.                                                                                                                                                                  |
| MESSAGES                      |         |            108.872795 |                                                                                                                                                                                                |
| MESSAGES-ROOT-CID             | BYTES   |                    35 | Size of the CID of the root merkle tree of the messages.                                                                                                                                       |
| MESSAGES-SIZE                 | BYTES   |             11540.517 | The total size of the messages in a block.                                                                                                                                                     |
| MIB                           | BYTES   |               1048576 | The number of bytes in one EiX.                                                                                                                                                                |
| MIN-TICKETS                   |         |                     0 |                                                                                                                                                                                                |
| MINER-ADDRESS-SIZE            |         |                    35 |                                                                                                                                                                                                |
| MINERS                        |         |                  1000 |                                                                                                                                                                                                |
| NODE-SIZE                     |         |                    32 |                                                                                                                                                                                                |
| NODES                         |         |            1073741824 |                                                                                                                                                                                                |
| OFFLINE-CHALLENGES            |         |              282.3536 |                                                                                                                                                                                                |
| ONE-BLOCK-IN-TEN-YEARS        |         |          9.506427e-09 |                                                                                                                                                                                                |
| ONLINE-CHALLENGES             |         |             136.53467 |                                                                                                                                                                                                |
| OPENING-PER-CHALLENGE         |         |                    15 |                                                                                                                                                                                                |
| OPENINGS                      |         |              4235.304 |                                                                                                                                                                                                |
| P-SIZE                        |         |                  35.0 |                                                                                                                                                                                                |
| PARALLEL-SEAL-TIME            |         |              8575.856 |                                                                                                                                                                                                |
| PARENT-WEIGHT-SIZE            |         |                     8 |                                                                                                                                                                                                |
| PARENTS                       |         |                     5 |                                                                                                                                                                                                |
| PARENTS-CIDS                  |         |                   175 |                                                                                                                                                                                                |
| PIB                           |         |      1125899906842624 |                                                                                                                                                                                                |
| POLLING-TIME                  |         |              825.6376 |                                                                                                                                                                                                |
| POREP-SNARK-CONSTRAINTS       |         |           295303680.0 |                                                                                                                                                                                                |
| POREP-SNARK-PARTITIONS        |         |             2.9530368 |                                                                                                                                                                                                |
| POREP-SNARK-PROOF-SIZE        |         |             566.98303 |                                                                                                                                                                                                |
| POREP-SNARK-TIME              |         |             17489.703 |                                                                                                                                                                                                |
| POST-CHALLENGE-BLOCKS         | BLOCKS  |                   480 | The time offset before which the actual work of generating the PoSt cannot be started. This is some delta before the end of the Proving Period, and as such less than a single Proving Period. |
| POST-CHALLENGE-HOURS          | HOURS   |                     2 | PoSt challenge time (see POST_CHALLENGE_BLOCKS).                                                                                                                                               |
| POST-CHALLENGE-TIME           | SECONDS |                  7200 | PoSt challenge time (see POST_CHALLENGE_BLOCKS).                                                                                                                                               |
| POST-CHALLENGES               |         |             136.53467 |                                                                                                                                                                                                |
| POST-PROOF-SIZE               |         |                   192 |                                                                                                                                                                                                |
| POST-PROVING-PERIOD           | BLOCKS  |                  5760 | The time interval in which a PoSt has to be submitted                                                                                                                                          |
| POST-SIZE-PER-BLOCK           |         |             2236.9622 |                                                                                                                                                                                                |
| POST-SNARK-CIRCUIT            |         |             5324852.0 |                                                                                                                                                                                                |
| POST-SNARK-PROOF-PARTITIONS   |         |                     1 |                                                                                                                                                                                                |
| POST-SNARK-PROOF-SIZE         |         |                   192 |                                                                                                                                                                                                |
| POSTS-PER-SECTOR-PER-YEAR     |         |                365.25 |                                                                                                                                                                                                |
| PROOF-MESSAGES-FRACTION       |         |                   0.4 |                                                                                                                                                                                                |
| PROOFGEN-TIME                 |         |             17489.703 |                                                                                                                                                                                                |
| PROOFS-SIZE-PER-BLOCK         |         |             22555.621 |                                                                                                                                                                                                |
| PROOFS-SIZE-PER-BLOCK-KIB     |         |             22.026974 |                                                                                                                                                                                                |
| PROVING-PERIOD-HOURS          |         |                    24 |                                                                                                                                                                                                |
| PROVING-PERIOD-SECONDS        |         |                 86400 |                                                                                                                                                                                                |
| RECEIPTS                      |         |            108.872795 |                                                                                                                                                                                                |
| RECEIPTS-SIZE                 |         |             1741.9647 | The total size of all message receipts, in bytes.                                                                                                                                              |
| REPLICA-COMMIT-TIME           |         |              42598.98 |                                                                                                                                                                                                |
| RESEAL                        |         |                     0 |                                                                                                                                                                                                |
| RETURN                        | BYTES   |                     4 | The size of a message's return value.                                                                                                                                                          |
| RSA-ELEMENT                   | BYTES   |                   256 | The size of an RSA element.                                                                                                                                                                    |
| SEAL-COMMITMENTS-SIZE         |         |                    70 |                                                                                                                                                                                                |
| SEAL-PROOF-SIZE               |         |             636.98303 |                                                                                                                                                                                                |
| SEAL-SIZE-PER-BLOCK           |         |             20318.658 |                                                                                                                                                                                                |
| SEAL-TIME                     |         |              66693.78 |                                                                                                                                                                                                |
| SEALS-PER-SECTOR-PER-YEAR     |         |                     1 |                                                                                                                                                                                                |
| SECTOR-SIZE                   |         |           34359738368 |                                                                                                                                                                                                |
| SECTOR-SIZE-GIB               |         |                    32 |                                                                                                                                                                                                |
| SECTORS-COUNT                 |         |             335544320 |                                                                                                                                                                                                |
| SNARK-MAX-CONSTRAINTS         |         |             100000000 |                                                                                                                                                                                                |
| SNARK-SINGLE-PROOF-SIZE       |         |                   192 |                                                                                                                                                                                                |
| SPACEGAP                      |         |                   0.1 |                                                                                                                                                                                                |
| STATE-ROOT-CID                |         |                    35 |                                                                                                                                                                                                |
| STORAGE-NETWORK-CAPACITY      |         | 1.152921504606847e+19 |                                                                                                                                                                                                |
| TIB                           |         |         1099511627776 |                                                                                                                                                                                                |
| TICKET-SIZE                   |         |                   832 |                                                                                                                                                                                                |
| TICKETS                       |         |                     1 |                                                                                                                                                                                                |
| TICKETS-SIZE                  |         |                   832 |                                                                                                                                                                                                |
| TIMESTAMP-SIZE                |         |                     8 |                                                                                                                                                                                                |
| TO-ADDRESS                    | BYTES   |                    35 | The size of a message's 'from address'.                                                                                                                                                        |
| TREE-DEPTH                    |         |                  30.0 |                                                                                                                                                                                                |
| TX-MESSAGES-FRACTION          |         |                   0.3 |                                                                                                                                                                                                |
| TX-MESSAGES-PER-BLOCK         |         |              32.66184 |                                                                                                                                                                                                |
| U64                           |         |                     8 | The size of a U64, in bytes.                                                                                                                                                                   |
| VALUE                         | BYTES   |                     8 | The size of a 'value' element.                                                                                                                                                                 |
| VARINT                        | BYTES   |                     4 | The size of a VarInt.                                                                                                                                                                          |
| VDF-OUTPUT-SIZE               |         |                     0 |                                                                                                                                                                                                |
| VDF-PROOF-SIZE                |         |                   768 |                                                                                                                                                                                                |
| YEAR-IN-SECONDS               | SECONDS |            31557600.0 | The number of seconds in one year.                                                                                                                                                             |



* Effect of Space Gap and Sector Size on Block Size.
#+begin_src lisp :package lang :exports results
  (let ((res (ask *filecoin* '(sector-size-gib spacegap lambda block-size-kib) *multi-input*)))
    (org-present res  *filecoin* :sort-by #'< :key (partial #'trf 'block-size-kib))))
#+end_src

#+RESULTS:
| LAMBDA | SPACEGAP | BLOCK-SIZE-KIB | SECTOR-SIZE-GIB |
|     10 |      0.2 |      2.0183308 |            1024 |
|     10 |      0.1 |      2.1250708 |            1024 |
|     10 |      0.2 |      2.2424922 |            1024 |
|     10 |     0.06 |      2.2729497 |            1024 |
|     10 |      0.1 |      2.5627122 |            1024 |
|     10 |     0.03 |      2.6715527 |            1024 |
|     80 |      0.2 |      2.7350836 |            1024 |
|     10 |      0.2 |       2.847705 |             256 |
|     10 |     0.06 |      3.0063488 |            1024 |
|     10 |      0.1 |      3.2539802 |             256 |
|     80 |      0.1 |       3.589003 |            1024 |
|     10 |     0.06 |      3.8169022 |             256 |
|     10 |      0.2 |      3.9404943 |             128 |
|     10 |     0.03 |      4.2021575 |            1024 |
|     80 |      0.2 |      4.3927507 |            1024 |
|     10 |      0.2 |       4.730614 |             256 |
|     10 |      0.1 |      4.7323604 |             128 |
|     80 |     0.06 |      4.7720346 |            1024 |
|     10 |     0.03 |      5.3342724 |             256 |
|     10 |      0.2 |       5.501524 |            1024 |
|     80 |      0.2 |        5.57777 |             256 |
|     10 |     0.06 |       5.829611 |             128 |
|     10 |      0.1 |        5.94944 |             256 |
|     80 |      0.1 |      6.9545097 |            1024 |
|     10 |      0.1 |       7.102623 |            1024 |
|     10 |     0.06 |       7.638206 |             256 |
|     80 |     0.03 |       7.960858 |            1024 |
|     10 |      0.2 |       8.008982 |             128 |
|     10 |     0.03 |       8.787309 |             128 |
|     80 |      0.1 |       8.827972 |             256 |
|     80 |      0.2 |       9.263679 |             128 |
|     10 |     0.06 |      9.3208065 |            1024 |
|     10 |      0.1 |      10.384581 |             128 |
|     10 |      0.2 |      10.399412 |              32 |
|     80 |     0.06 |      10.503603 |            1024 |
|     10 |     0.03 |      12.190317 |             256 |
|     80 |      0.2 |      12.920809 |             256 |
|     80 |     0.06 |      13.331349 |             256 |
|     10 |      0.1 |     13.4014015 |              32 |
|     10 |     0.06 |      13.676332 |             128 |
|     10 |     0.03 |     15.2998495 |            1024 |
|     80 |      0.1 |      15.598608 |             128 |
|     80 |      0.2 |      16.252815 |            1024 |
|     10 |     0.06 |      17.561655 |              32 |
|     10 |      0.2 |      17.942131 |             256 |
|     80 |     0.03 |      20.070072 |            1024 |
|     10 |     0.03 |      22.549423 |             128 |
|     80 |      0.1 |      22.671417 |             256 |
|     80 |      0.2 |      23.978535 |             128 |
|     10 |      0.1 |      24.036263 |             256 |
|     80 |     0.06 |      24.376612 |             128 |
|     80 |     0.03 |      25.470312 |             256 |
|     10 |      0.2 |      27.385735 |              32 |
|     10 |     0.03 |      28.776114 |              32 |
|     80 |      0.1 |      29.061607 |            1024 |
|     80 |      0.2 |      30.596579 |              32 |
|     10 |     0.06 |       32.48009 |             256 |
|     10 |      0.2 |       34.33397 |             128 |
|     80 |     0.06 |      36.181545 |             256 |
|     10 |      0.1 |        36.3917 |              32 |
|     80 |      0.1 |      42.983322 |             128 |
|     10 |      0.1 |      46.211964 |             128 |
|     80 |     0.06 |       46.80707 |            1024 |
|     80 |     0.03 |      48.038197 |             128 |
|     10 |     0.06 |      48.872463 |              32 |
|     80 |      0.1 |      54.612484 |              32 |
|     10 |     0.03 |      55.240646 |             256 |
|     80 |      0.2 |       58.89311 |             256 |
|     10 |     0.06 |      62.670723 |             128 |
|     80 |     0.06 |       69.31734 |             128 |
|     80 |     0.03 |       72.59843 |             256 |
|     10 |     0.03 |       82.51584 |              32 |
|     80 |     0.06 |       87.89453 |              32 |
|     80 |      0.2 |      87.977234 |              32 |
|     80 |     0.03 |       94.63942 |            1024 |
|     10 |     0.03 |      107.03619 |             128 |
|     80 |      0.1 |      107.64613 |             256 |
|     80 |      0.2 |      114.18173 |             128 |
|     10 |      0.2 |      131.21773 |              32 |
|     80 |     0.03 |      140.30208 |             128 |
|     80 |      0.1 |      160.02498 |              32 |
|     80 |     0.06 |      175.19678 |             256 |
|     10 |      0.1 |      176.24756 |              32 |
|     80 |     0.03 |       177.6102 |              32 |
|     80 |      0.1 |      209.20566 |             128 |
|     10 |     0.06 |      238.65137 |              32 |
|     80 |     0.06 |       259.8711 |              32 |
|     80 |     0.06 |       340.8757 |             128 |
|     80 |     0.03 |       357.2812 |             256 |
|     10 |     0.03 |      406.86823 |              32 |
|     80 |      0.2 |      434.17523 |              32 |
|     80 |     0.03 |        529.018 |              32 |
|     80 |     0.03 |      695.79944 |             128 |
|     80 |      0.1 |       794.4138 |              32 |
|     80 |     0.06 |      1293.6443 |              32 |
|     80 |     0.03 |      2639.3792 |              32 |


* Parameter Definitions
#+INCLUDE: "../orient/filecoin.orient" src text
* Parsed Parameter Definitions
#+INCLUDE: "../../build/orient/filecoin.json" src json
